---
kind: other
id: Methods.T:Autodesk.Revit.DB.IFC.HostObjectSubcomponentInfo
source: html/25293867-3a36-47ab-5772-9cfb34386a90.htm
---
# HostObjectSubcomponentInfo Methods

Gets the CurveLoop representing the base profile curve loop of the roof or floor slab